Revit 2024 API
PathReinforcement.PrimaryBarShapeId Property
 The RebarShape element that defines the shape of the primary bars of the Path Reinforcement.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public ElementId PrimaryBarShapeId { get; set; }
Visual Basic
Public Property PrimaryBarShapeId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ PrimaryBarShapeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Remarks
 Changing the value of this property causes the Path Reinforcement to choose values for its shape parameters.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: shapeId should refer to two dimensional Rebar Shape element with segments forming only right angles.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: This PathReinforcement does not host Rebar.
See Also
PathReinforcement Class
Autodesk.Revit.DB.Structure Namespace